# MepSpotBottomElevationIncludeInsulation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepSpotBottomElevationIncludeInsulation Property
ParameterTypeId Class See Also
---
"Spot Bottom of Insulation Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepSpotBottomElevationIncludeInsulation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepSpotBottomElevationIncludeInsulation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepSpotBottomElevationIncludeInsulation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace